export enum botMessages {
  result = 'result',
  start = 'Welcome, bro',
  quickBets = 'Быстрые ставки',
  info = '‼️ Это не кнопка по заработыванию денег, а подсказки на что обратить внимание',
  introduction = 'Очередной торговый сет 👨🏼‍💻🤩🤑🚀\nЗаряжаемся и погнали! 🚀👨🏼‍💻☄️😎\n',
  return = '\n',
  fiveMinuteLimit = '🚀 Заходить можно в течении 5 минут, закрываемся по своему усмотрению.',
  aboutGeneralStonks = 'Telegram-канал ‍💻 Stonks ‍💻 – проект команды Banda.\n\n' +
    'Как устроен канал: "Искусственный интеллект" анализирует рынок, отбирает торговые пары и отправляет сигналы.\n\n' +
    'Бесплатно и стабильно ✅🚀🚀\n' +
    'Сигналы приходят каждые 2-3 часа✅🚀🚀\n' +
    'Ежедневные отчеты по нашей торговле ✅🚀🚀\n' +
    'Ведем разработку сервиса для автоматизированной торговли ✅🚀🚀\n\n' +
    '🤑🚀Доступ в закрытый канал - 30 USDT/мес. В закрытом канале сигналы приходят каждые 15 минут',
}

export const riskManagementMessages = [
  '✅ Перед открытием сделок проведите тщательный анализ',
  '✅ Не переводите на торговый счет все свои сбережения',
  '✅ Используйте Stop Loss',
  '✅ Отдавайте предпочтение торговле по тренду',
  '✅ Не бойтесь признать свою неправоту и получить убыток',
  '✅ Помните о мерах защиты при торговле',
  '✅ Торгуйте в меру',
  '✅ Держите эмоции под контролем',
  '✅ При сомнениях выходите из рынка',
  '✅ Заранее продумывайте точку выхода из сделки',
  '✅ Иногда ничего не делать - правильное действие',
];
